print('\nЗадача 1. Функция сумма чисел.\n')

# РЕШЕНИЕ
# Напишите функцию num_sum(a), принимающую любое значение.
# Если это целое число, то возвратить сумму его чисел.
# В противном случае возвращается фраза «Это не целое число».
# =============================

# region {===== Основной код =====}

def num_sum(a):
   # 1. Определяем принадлежность значения 'a' к целому числу, но не к булеву типу
   if isinstance(a, int) and not isinstance(a, bool):
       # 2. Преобразуем число в положительное, а потом - строку
       a_to_str = str(abs(a))
       # 3. Задаем начальную сумму 0
       s = 0
       # 4. В цикле складываем все числа
       for i in a_to_str:
           s += int(i)
       return s
   return 'Это не целое число'

# Тесты
print(num_sum(-146))
print(num_sum('-11'))
print(num_sum(True))

# endregion {===== Основной код =====}