print('\nЗадача 3. .\n')

# РЕШЕНИЕ
# Напишите функцию search_substr(subst, st), которая принимает 2 строки и определяет,
# имеется ли подстрока subst в строке st.
# В случае нахождения подстроки, возвращается фраза «Есть контакт!»,
# а иначе «Мимо!».
# Должно быть найдено совпадение независимо от регистра обеих строк.
# =============================


# region {===== Основной код =====}

def search_substr(subst, st):
    if subst.lower() in st.lower():
        return 'Есть контакт!'
    else:
        return 'Мимо!'


# Тесты
print(search_substr('Кол', 'коЛокОл'))
print(search_substr('Колобок', 'колобоК'))
print(search_substr('Кол', 'Плов'))

# endregion {===== Основной код =====}